In [27]:
# Persiapan membuat data
import pandas as pd
import random

pelajaran = ['Matematika', 'Fisika', 'Biologi', 'Kimia', 'Geologi', 'Ekonomi']
kelas = ['12A', '12B', '12C', '12D']

hasil_nilai = {
    'siswa_id' : range(1, 21),
    'pelajaran' : [random.choice(pelajaran) for i in range(20)],
    'nilai' : [random.choice(range(0, 100)) for i in range(20)],
    'jenis_kelamin' : [random.choice(['laki-laki', 'perempuan']) for i in range(20)],
    'kelas' : [random .choice(kelas) for i in range(20)]
}

df = pd.DataFrame(hasil_nilai)
df.head()

   siswa_id   pelajaran  nilai jenis_kelamin kelas
0         1      Fisika     81     perempuan   12C
1         2  Matematika     14     perempuan   12C
2         3      Fisika     54     perempuan   12C
3         4       Kimia     79     perempuan   12B
4         5     Ekonomi     77     laki-laki   12D

<h2>Soal 1: Indexing</h2>

1. Lakukan indexing terhadap dataframe untuk mengakses column nilai dan kelas saja
2. Lakukan indexing terhadap dataframe untuk mengakses row 5 sampai 10 beserta column pelajaran dan nilai

In [28]:
print(df.loc[3 , 'kelas'])
print(df.loc[5,'pelajaran'])

12B
Matematika

<h2>Soal 2: Filter DataFrame Dengan Boolean</h2>

1. Tampilkan semua data siswa pada mata pelajaran Ekonomi dan Fisika
2. Tampilkan semua data siswa yang mempunyai nilai lebih dari 50 di mata pelajaran Kimia 
3. Tampilkan semua data yang mempunyai nilai lebih dari 70, berjnis kelamin perempuan dan di kelas 12C

In [29]:
#1 
df[(df['pelajaran']=="Ekonomi") | (df['pelajaran']=='Kimia')]

    siswa_id pelajaran  nilai jenis_kelamin kelas
3          4     Kimia     79     perempuan   12B
4          5   Ekonomi     77     laki-laki   12D
9         10     Kimia     70     laki-laki   12A
14        15   Ekonomi     14     laki-laki   12C
16        17   Ekonomi     96     laki-laki   12D

In [30]:
#2 
df[(df['nilai']>50) & (df['pelajaran'] =="Kimia")]

   siswa_id pelajaran  nilai jenis_kelamin kelas
3         4     Kimia     79     perempuan   12B
9        10     Kimia     70     laki-laki   12A

In [31]:
#3 
df[(df['nilai'] > 70) & (df['jenis_kelamin'] =="perempuan") & (df['kelas'] =='12C')]

    siswa_id   pelajaran  nilai jenis_kelamin kelas
0          1      Fisika     81     perempuan   12C
11        12  Matematika     73     perempuan   12C

<h2>Soal 3: Data Transformation</h2>

lakukan data transformasi terhadap column 'nilai' dengan fungsi transformasi, berikut rumus dari normalisasi

![alt text](https://drive.google.com/uc?id=1wed-EbRSTA0JP1ceDp6lcKBqH2yJ4aa3)

In [35]:
def minus_minimum(nilai):
    return nilai - nilai.min() 
transform = df[['nilai']].apply(minus_minimum)
selisih = df.nilai.max() - df.nilai.min()
x_norm = transform/selisih 
print(x_norm)

       nilai
0   0.843750
1   0.145833
2   0.562500
3   0.822917
4   0.802083
5   0.458333
6   0.562500
7   0.687500
8   0.489583
9   0.729167
10  0.000000
11  0.760417
12  0.875000
13  0.760417
14  0.145833
15  0.760417
16  1.000000
17  0.687500
18  0.250000
19  0.343750